{"0": {"news": "Meyer Handelman Co. Increases Position in TE Connectivity Ltd. (NYSE:TEL). Meyer Handelman Co. Increases Position in TE Connectivity Ltd. (NYSE:TEL) Posted by Tammy Falkenburg on Feb 10th, 2021 Tweet\nMeyer Handelman Co. grew its position in shares of TE Connectivity Ltd. (NYSE:TEL) by 2.4% during the fourth quarter, according to its most recent Form 13F filing with the Securities & Exchange Commission. The institutional investor owned 132,718 shares of the electronics maker’s stock after purchasing an additional 3,060 shares during the period. Meyer Handelman Co.’s holdings in TE Connectivity were worth $16,067,000 as of its most recent SEC filing.\nSeveral other institutional investors and hedge funds have also recently added to or reduced their stakes in the company. Perigon Wealth Management LLC acquired a new stake in shares of TE Connectivity in the fourth quarter valued at $31,000. Prospera Financial Services Inc acquired a new position in TE Connectivity during the 3rd quarter worth about $33,000. JJJ Advisors Inc. boosted its holdings in TE Connectivity by 527.3% during the 4th quarter. JJJ Advisors Inc. now owns 276 shares of the electronics maker’s stock valued at $33,000 after acquiring an additional 232 shares during the period. CX Institutional grew its position in TE Connectivity by 59.5% in the 3rd quarter. CX Institutional now owns 362 shares of the electronics maker’s stock valued at $35,000 after acquiring an additional 135 shares in the last quarter. Finally, NEXT Financial Group Inc purchased a new stake in TE Connectivity during the third quarter worth about $43,000. Institutional investors and hedge funds own 91.35% of the company’s stock. Get TE Connectivity alerts:\nSeveral research firms have recently commented on TEL. Robert W. Baird reissued an “outperform” rating and issued a $118.00 price objective on shares of TE Connectivity in a research note on Monday, October 19th. Morgan Stanley raised their price target on shares of TE Connectivity from $121.00 to $127.00 and gave the company an “equal weight” rating in a research report on Thursday, January 28th. Jefferies Financial Group upped their price objective on TE Connectivity from $107.00 to $126.00 and gave the stock a “buy” rating in a research report on Thursday, October 15th. TheStreet upgraded TE Connectivity from a “c” rating to a “b” rating in a research note on Wednesday, October 28th. Finally, UBS Group boosted their target price on TE Connectivity from $135.00 to $150.00 and gave the stock a “buy” rating in a research note on Thursday, January 28th. Four research analysts have rated the stock with a hold rating and ten have given a buy rating to the company’s stock. The company currently has an average rating of “Buy” and an average target price of $111.79. In other TE Connectivity news, Director Terrence R. Curtin sold 70,250 shares of the company’s stock in a transaction on Thursday, February 4th. The shares were sold at an average price of $127.75, for a total value of $8,974,437.50. Following the completion of the transaction, the director now owns 125,219 shares in the company, valued at $15,996,727.25. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through this hyperlink . Also, SVP Mario Calastri sold 48,387 shares of the firm’s stock in a transaction dated Tuesday, November 24th. The stock was sold at an average price of $115.52, for a total value of $5,589,666.24. In the last three months, insiders have sold 173,688 shares of company stock worth $21,029,106. 0.80% of the stock is owned by corporate insiders.\nNYSE TEL traded down $0.69 during trading on Wednesday, reaching $128.10. 39,890 shares of the company’s stock were exchanged, compared to its average volume of 2,040,664. The company has a 50 day moving average price of $125.15 and a two-hundred day moving average price of $108.41. The stock has a market cap of $42.39 billion, a P/E ratio of -178.87, a price-to-earnings-growth ratio of 2.35 and a beta of 1.41. TE Connectivity Ltd. has a 1 year low of $48.62 and a 1 year high of $131.97. The company has a debt-to-equity ratio of 0.37, a quick ratio of 1.04 and a current ratio of 1.57.\nTE Connectivity (NYSE:TEL) last issued its earnings results on Tuesday, January 26th. The electronics maker reported $1.47 earnings per share for the quarter, topping the consensus estimate of $1.29 by $0.18. The business had revenue of $3.52 billion for the quarter, compared to analyst estimates of $3.26 billion. TE Connectivity had a positive return on equity of 14.86% and a negative net margin of 1.98%. The business’s quarterly revenue was up 11.2% on a year-over-year basis. During the same quarter last year, the company earned $1.21 EPS. Research analysts forecast that TE Connectivity Ltd. will post 5.3 EPS for the current fiscal year.\nThe business also recently disclosed a quarterly dividend, which will be paid on Friday, March 5th. Shareholders of record on Friday, February 19th will be issued a dividend of $0.48 per share. The ex-dividend date is Thursday, February 18th. This represents a $1.92 dividend on an annualized basis and a yield of 1.50%. TE Connectivity’s payout ratio is currently 45.07%.\nAbout TE Connectivity\nTE Connectivity Ltd., together with its subsidiaries, manufactures and sells connectivity and sensor solutions in Europe, the Middle East, Africa, the AsiaÂ-Pacific, and the Americas. The company operates through three segments: Transportation Solutions, Industrial Solutions, and Communications Solutions.\nSee Also: Holder of Record\nWant to see what other hedge funds are holding TEL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for TE Connectivity Ltd. (NYSE:TEL). Receive News & Ratings for TE Connectivity Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for TE Connectivity and related companies with MarketBeat.com's FREE daily email newsletter ."}, "1": {"news": "Bank of England Governor lashes out at EU after demanding too much from UK in finance feud. Robert Jenrick is here to sort out the cladding problem – by doing the bare minimum, years too late Bruce Springsteen was arrested for DWI and reckless driving Andrew Bailey 'asked banks to step up no deal plans' says expert Daily Express See more videos SHARE SHARE TWEET SHARE EMAIL What to watch next Dr Ranj discusses HIV testing on This Morning\nDaily Express Grant Shapps says easing UK travel restrictions is 'off the cards'\nDaily Express Prince Andrew helped save Windsor Castle treasures says expert\nDaily Express Queen 'surprised with detail on coronation dress' says expert\nDaily Express Sarah Ferguson's 'strange' wedding conduct discussed by expert\nDaily Express HMS Severn: Royal Navy warship arrives at Devonport in May 2020\nDaily Express Captain Cook's early professional life discussed by expert\nDaily Express Tianwen-1: China's Mars mission discussed by expert\nDaily Express Tsunami: Graph showcases stimulation and impact\nDaily Express USA: Expert reveals how CIA stopped cyber HACKING from China\nDaily Express Indonesia: 7 magnitude earthquake strikes country\nDaily Express Indonesia: Earthquake hits island of Sumatra\nDaily Express Sun: Large plasma ‘raindrops' spotted on star\nDaily Express Turkey: Erdogan warns Mitsotakis 'don't challenge me'\nDaily Express PMQs: Boris Johnson told to 'stop teasing' Blackford by speaker\nDaily Express PMQs: Boris Johnson slams Blackford on 'left-wing' stance\nDaily Express Click to expand Replay Video Dr Ranj discusses HIV testing on This Morning Doctor Ranj Singh discusses home testing kits for HIV and AIDS during an appearance on This Morning. Daily Express Grant Shapps says easing UK travel restrictions is 'off the cards' Travel Secretary Grant Shapps says easing the UK's current travel restrictions is 'off the cards', until we see a reduction in deaths and coronavirus cases. Daily Express Prince Andrew helped save Windsor Castle treasures says expert Royal expert Ingrid Seward reveals that Prince Andrew helped co-ordinate the effort to save the treasures of Windsor Castle during a fire in 1992. Daily Express UP NEXT Mr Bailey urged Brussels to back away from a spat with Britain concerning trade in financial services after Brexit. He accused the bloc of levelling greater demands against London than other partners. He that the EU has granted long-term market access for securities clearing houses from the US but not for their UK counterparts even though they comply with the same rules.\nIn the text of a speech he was due to deliver on Wednesday, the banking chief said: \"The EU has argued it must better understand how the UK intends to amend or alter the rules going forwards.\n\"This is a standard that the EU holds no other country to and would, I suspect, not agree to be held to itself.\"\nReferring to the EU's demands, he said it is difficult to \"see beyond one of two ways of interpreting this statement, neither of which stands up to much scrutiny.\"\nHe added: \"We have an opportunity to move forward and rebuild our economies, post-COVID, supported by our financial systems.\n© GETTY Bank of England Governor lashes out at EU after demanding too much from UK in finance feud © GETTY brexit news latest \"Now is not the time to have a regional argument.\"\nHe said the UK should not be forced to follow the same rules for financial services as the EU and agreeing to not change rules in future would be \"unrealistic, dangerous and inconsistent with practice\".\nIn his annual Mansion House speech to the City of London, Mr Bailey said the UK should also be allowed to change rules independently, and agreeing to only follow EU rules would be \"rule-taking pure and simple\".\nHe added: \"It is not acceptable when UK rules govern a system 10 times the size of the UK GDP (gross domestic product) and is not the test up to now to assess equivalence.\"\n© GETTY brexit bank of england news The Bank of England Governor also said a low-regulation financial system would not be in the UK's best interests.\nHis words were a slapdown to calls for a Singapore-style regime for banks.\nHe said: \"Let me be clear, none of this means that the UK should or will create a low-regulation, high-risk, anything goes financial centre and system.\n© GETTY brexit news latest © GETTY brexit bank of england news \"We have an overwhelming body of evidence that such an approach is not in our own interests, let alone anyone else's.\n\"That said, I believe we have a very bright future competing in global financial markets underpinned by strong and effective common global regulatory standards.\"\nHis warning comes just over a month after the UK exited the Brexit transition period.\nUK and EU counterparts are negotiating the terms of a memorandum of understanding over access for City institutions to European financial markets.\n© EXPRESS Brexit end game Regulators are hoping to have a deal signed by next month.\nHowever, Brussels has suggested the UK must follow rules for a number of years without diverging.\nIn his speech, the banking chief pointed out that it was up to regulators to determine which rules can be considered equivalent - as happens in other nations - rather than just following rules to the letter.\nAsked whether the UK risks being cut off from the EU financial system, Mr Bailey said: \"I think that would be a mistake.\n\"It raises the cost of finance for everybody including the citizens of the EU.\n© GETTY brexit bank of england news \"It will raise the cost of doing business in the EU, so I think it's a mistake.\"\nMr Bailey was appointed Bank of England Governor in December 2019.\nHe took over from Mark Carney in March of last year.\nMr Bailey previously served as chief executive of the Financial Conduct Authority (FCA), the City watchdog.\nMicrosoft and partners may be compensated if you purchase something through recommended links in this article."}, "2": {"news": "Big Pharma’s COVID Vaccine. Introduction\nThe plan to develop the Covid-19 vaccine is profit driven.\nThe US government had already ordered 100 million doses back in July 2020 and the EU is to purchase 300 million doses. It’s Big Money for Big Pharma, generous payoffs to corrupt politicians, at the expense of tax payers. The objective is ultimately to make money, by vaccinating the entire planet of 7.8 billion people for SARS-CoV-2. The Covid vaccine in some cases envisages more than one shot. If this initiative were to go ahead as planned, it would be the largest vaccine project in World history and the biggest money making operation for Big Pharma.\nThe Second Wave of the pandemic commenced in October 2020. The Pfizer Moderna corona vaccine was launched in early November 2020.\nWorldwide, people are led to believe that the corona vaccine is a solution. And that “normality” will then be restored.\nHow is it that a vaccine for the SARS-CoV-2 virus, which under normal conditions would take years to develop, was promptly launched on the 9th of November?\nMoreover, the vaccine announced by Pfizer and Moderna is based on an experimental gene editing mRNA technology which has a bearing on the human genome. Coupled with the vaccine initiative is the development of a so-called digital passport which will be imposed on entire populations. (See analysis below).\nAnd why do we need a vaccine for Covid-19 when the WHO, the US Center for Disease Control and Prevention (CDC) as well as numerous scientists have confirmed unequivocally that Covid-19 is “similar to seasonal influenza”.( See our analysis in Chapter II).\nThe Drive to Develop a Corona Vaccine is Profit\nIt would appear that the standard lab tests using ferrets and mice will not be conducted.\n“Human tests began in late July and early August [2020]. Three months is unheard of for testing a new vaccine. Several years is the norm.”\nThis caricature by Large + JIPÉM explains our predicament:\nMouse No 1: “Are You Going to get Vaccinated”,\nMouse No. 2: Are You Crazy, They Haven’t finished the Tests on Humans”\nUn grand merci aux caricaturistes Large et JIPÉM\nDr. Michael Yeadon, a former Vice President of Pfizer has taken a firm stance : “All vaccines against the SARS-COV-2 virus are by definition novel. No candidate vaccine has been… in development for more than a few months.”:\n“If any such vaccine is approved for use under any circumstances that are not EXPLICITLY experimental, I believe that recipients are being misled to a criminal extent.”\nIn early December, Dr Michael Yeadon together with Dr. Wolfgang Wodarg “ filed an application with the EMA , the European Medicine Agency responsible for EU-wide drug approval, for the immediate suspension of all SARS CoV 2 vaccine studies, in particular the BioNtech/Pfizer study on BNT162b (EudraCT number 2020-002641-42).\nIt is important to review the complex history of the novel vaccine. History of the SARS-CoV-2 Vaccine Project\nThere are many contradictions. The analysis below addresses the earlier stages of the vaccine project as well as the role of the 201 Simulation under the auspices of the John Hopkins School of Medicine held in New York on October 19, 2019.\nThe Covid vaccine is a multibillion dollar Big Pharma operation which will contribute to increasing the public debt of more than 150 national governments.\nSupported by the fear campaign, Money rather than Public Health is the driving force behind this initiative. The GSK-Pfizer Partnership Five months before the onset of the Covid-19 crisis, two of the largest Worldwide Pharma conglomerates decided to join hands in a strategic relationship. In August 2019, GSK confirmed the formation of a major partnership with Pfizer entitled the Consumer Health Joint Venture .\nWhile the relationship is said to be limited to “trusted consumer health brands”, the agreement envisages joint financial procedures including joint multibillion dollar investment projects. While it does not constitute a merger, the GSK-Pfizer alliance implies selective integration and de facto collusion in many of the two companies’ activities including the vaccine market. “ The completion of the joint venture with Pfizer marks the beginning of the next phase of our transformation of GSK. This is an important moment for the Group, laying the foundation for two great companies, one in Pharmaceuticals and Vaccines and one in Consumer Health.” ( GSK , August 1, 2019, emphasis added) This GSK-Pfizer relationship also encompasses a network of partner pharmaceutical companies, research labs, virology institutes, military and biotech entities, etc. many of which are currently involved in the Covid vaccine initiative.\nAt present, a handful of multinational companies including GSK and Pfizer control 80% of the global vaccine market. Under the agreement between the two companies, GSK-Pfizer is slated to play a dominant and coordinated role in regards to the Covid-19 vaccine.\nThe October 2019 Coronavirus Event 201 Simulation Exercise\nThe coronavirus was initially named nCoV-19 by CEPI and the WHO: exactly the same name as that adopted in the WEF-Gates-John Hopkins Event 201 ( 2019-nCov ) pertaining to a coronavirus simulation exercise held in Baltimore in mid October 2019.\nThe Event 201 John Hopkins simulation addressed the development of an effective vaccine in response to millions of cases (in the October 2019 simulation) of the 2019 nCoV. The simulation announced a scenario in which the entire population of the planet would be affected: “During the initial months of the pandemic, the cumulative number of cases [in the simulation] increases exponentially, doubling every week. And as the cases and deaths accumulate, the economic and societal consequences become increasingly severe.”\nThe scenario ends at the 18-month point, with 65 million deaths. The pandemic is beginning to slow due to the decreasing number of susceptible people. The pandemic will continue at some rate until there is an effective vaccine or until 80-90 % of the global population has been exposed. From that point on, it is likely to be an endemic childhood disease.\nAccording to the WEF Video below, produced in relation to the 201 Simulation, “we ran a massive viral pandemic simulation.., 65 million deaths Worlwide.”.\nSee also the analysis of F. William Engdahl on the 201 Simulation\nVideo Produced by the World Economic Forum in association with the 201 John Hopkins Simulation\nIronically, on January 30th 2020, the WHO defined the new virus as 2019-nCoV , i.e. the same name as that used in the 201 simulation in October 2019.\nIt was only later that Covid-19 was identified by the WHO not as a virus but as a disease: coronavirus disease (COVID-19), the Virus was identified as “severe acute respiratory syndrome” coronavirus 2 ( SARS-CoV-2 )\nTwo weeks after the virus had been formally identified by the People’s Republic of China (Jan 7, 2020), a vaccine for the novel coronavirus was announced by CEPI at the Davos World Economic Forum, January 20-24, 2020.\nThe Central Role of the Coalition for Epidemic Preparedness Innovations (CEPI)\nThe lead entity for the novel coronavirus vaccine initiative is the Coalition for Epidemic Preparedness Innovations (CEPI) an organization sponsored and financed by the World Economic Forum (WEF) and the Bill and Melinda Gates Foundation.\nNote the chronology: The development of the 2019 nCoV vaccine was announced at the Davos World Economic Forum (WEF) a week prior to the official launching by the WHO of a Worldwide Public Health Emergency (January 30) at a time when the number of “confirmed cases” Worldwide (outside China) was 83. ( see Chapter II)\nThe pandemic was launched by the WHO on March 11. And five days later, barely covered by the media, the first tests involving human volunteers were conducted by Moderna in Seattle on March 16.\nAccording to Richard Hatchett, CEO of the Coalition for Epidemic Preparedness Innovations (CEPI) the project to develop a vaccine commenced not only prior to the discovery and identification of the coronavirus (January 7, 2020) but several months prior to the October 2019 Scenario 201 simulation exercise.\n“We did that in the last year or so [early 2019] . … ”\n(scroll down for interview with Richard Hatchett)\nCEPI is seeking a “monopoly” role in the vaccination business the objective of which is a “global vaccine project”, in partnership with a large number of “candidates”.\nIt announced funding for its existing partnership with Inovio and The University of Queensland (Australia). In addition, CEPI confirmed (January 23, 2020) its contract with Moderna, Inc . and the U.S. National Institute of Allergy and Infectious Diseases (NIAID) headed by Dr. Anthony Fauci, who has been instrumental in waging the fear and panic campaign across America: “Ten Times Worse than Seasonal Flu”. ( See WEF Video )\nCEPI was dealing simultaneously with several pharmaceutical companies. The Moderna- NIAID agreement was implemented. The mRNA COVID-19 vaccine was launched in the US in late November 2020.\nOn January 31st, 2020 the day following the WHO’s official launching of the global public health emergency (PHEIC) and Trump’s decision to curtail air travel with China, CEPI announced its partnership with CureVac AG , a German-based biopharmaceutical company.\nA few days later, in early February 2020, CEPI “announced that major vaccine manufacturer GSK would allow its proprietary adjuvants — compounds that boost the effectiveness of vaccines — to be used in the response”. (The pandemic was officially launched on March 11).\nThere were many “potential vaccines in the pipeline” with “dozens of research groups around the world racing to create a vaccine against COVID-19”. The COV-19 Global Vaccination Program\nCEPI (on behalf of Gates-WEF, which funded the 201 simulation exercise) is currently playing a key role in a large scale Worldwide vaccination program in partnership with biotech companies, Big Pharma, government agencies as well as university laboratories.\nThe foregoing statement by CEPI was made nearly two months prior to the official declaration of a pandemic on March 11. “We’re having conversations with a broad array of potential partners”. And critical to those conversations is: What’s the plan to make very large quantities of vaccine within a time frame that is potentially relevant to what people seem to be increasingly certain will be a pandemic, if it isn’t already there? …” [ Richard Hatchett, CEPI CEO in interview with stat.news.com]. …\nThe underlying focus was to develop a global vaccine:\nAnd part of that was doing a global survey of manufacturing capacity to think about where we wanted to plant the manufacturing of any successful products we were able to bring forward.\nOf significance, Hatchett confirmed that the project to develop a vaccine commenced not only prior to the discovery and identification of the coronavirus (January 7, 2020) but several months prior to the October 2019 201 simulation exercise.\n“We did that in the last year or so . [early 2019]… We are using the information that we have collected and have that team now thinking about opportunities for scaling vaccines of various different types. That is a work in progress. For some of the technologies the tech transfer [to a manufacturer] may be something that could be done in a time frame that was pertinent to the epidemic, potentially.\nI think it is going to be really important to engage those folks who have access to really substantial production capacity. And having the big producers at the table — because of their depth, because of their experience, because of their internal resources — would be very, very important.\nThe candidate vaccines will be very, very quick. Dr. Anthony Fauci, director of NIAID [who has been spreading panic on network TV], is out in public as saying he thinks the clinical trial for the Moderna vaccine may be as early as the spring. (emphasis added)\nWhat is now unfolding in real life is in some regards similar to the October 2019 201 Simulation exercise at John Hopkins.\nThe scenario is how to produce millions of vaccine shots on the presumption that the pandemic will spread Worldwide, and for that you need the Covid-19 “positive cases” to go fly high.\nThe CEPI sponsored vaccine conglomerates had already planned their investments well in advance of the global Worldwide health emergency (PHEIC) (declared by the WHO on January 30, 2020):\nI [Hachett] think part of the general strategy is to have a large number of candidates. [and] you want to have enough candidates that at least some of them are moving rapidly through the process.\nAnd then for each candidate, you need to ask yourself the question: How do you produce that? … [And] how are you going to get to that point with production at a scale that is meaningful in the context of a disease that is going to infect the whole of society? (Interview conducted by Helen Branswell, statsnews, February 3, 2020)\nModerna Inc\nModerna Inc based in Seattle was one of the several candidates involved and supported by CEPI.\nModerna announced on February 24th the development of “an experimental mRNA COVID-19 vaccine, known as mRNA-1273″. “ The initial batch of the vaccine has already been shipped to U.S. government researchers from the National Institute of Allergy and Infectious Diseases (NIAID)” headed by Dr. Antony Fauci.\nWhile Moderna Inc initially stated that the first clinical trials would commence in late April , tests involving human volunteers started in mid-March in Seattle: (bear in mind the pandemic was officially launched on March 11)\nResearchers in Seattle gave the first shot to the first person in a test of an experimental coronavirus vaccine Monday — leading off a worldwide hunt for protection even as the pandemic surges. …\nSome of the study’s carefully chosen healthy volunteers, ages 18 to 55, will get higher dosages than others to test how strong the inoculations should be. Scientists will check for any side effects and draw blood samples to test if the vaccine is revving up the immune system, looking for encouraging clues like the NIH earlier found in vaccinated mice.\n“We don’t know whether this vaccine will induce an immune response, or whether it will be safe. That’s why we’re doing a trial,” Jackson stressed. “It’s not at the stage where it would be possible or prudent to give it to the general population.” ( FOX news local) The Covid Vaccine and the ID2020 Digital Identity Platform While CEPI had announced the launching of a global vaccine at the Davos World Economic Forum, another important and related endeavor was underway. It’s called the ID2020 Agenda , which, according to Peter Koenig constitutes “ an electronic ID program that uses generalized vaccination as a platform for digital identity”.\n“The program harnesses existing birth registration and vaccination operations to provide newborns with a portable and persistent biometrically-linked digital identity”. ( Peter Koenig, March 2020)\nThe founding Partners of ID2020 are Microsoft, the Rockefeller Foundation and the Global Alliance for Vaccines and Immunization (GAVI) among others.\nIt is worth noting the timeline: T he ID2020 Alliance held their Summit in New York, entitled “Rising to the Good ID Challenge”, on September 19, 2019, exactly one month prior to nCov-2019 simulation exercise entitled Event 201 at John Hopkins in New York:\nIs it just a coincidence that ID2020 is being rolled out at the onset of what the WHO calls a Pandemic? – Or is a pandemic needed to ‘roll out’ the multiple devastating programs of ID2020? ( Peter Koenig, March 2020)\nID2020 is part of a “World Governance” project which, if applied, would roll out the contours of what some analysts have described as a Global Police State encompassing through vaccination the personal details of several billion people Worldwide. According to Dr. David Martin (quoted by Makia Freeman) : “This is not a vaccine … using the term vaccine to sneak this thing under public health exemptions … This is a mRNA packaged in a fat envelope that is delivered to a cell. It is a medical device designed to stimulate the human cell into becoming a pathogen creator. It is not a vaccine! Vaccines actually are a legally defined term … under public health law … under CDC and FDA standards, and a vaccine specifically has to stimulate both an immunity within the person receiving it, but it also has to disrupt transmission.\nIn the Wake of the Lockdown. The Second Wave\nThe Second Wave: The fear campaign continues in the wake of the lockdown. A new lockdown is unfolding (December-January) in several countries.\nWill the hardships of the economic and social crisis (coupled with a fear campaign) encourage people to get vaccinated?\nTo implement the Global Vaccine, the propaganda campaign must continue. The Truth must be suppressed. These are their “guidelines”, which must be confronted and challenged.\nSeveral governments (aka corrupt politicians) including the US, UK, France, Germany, Canada as well as India have already provided the green light. Information and analysis on the features of the virus (similar to seasonal influential) is being suppressed by the media.\nWhile Hydroxychloroquine (HCQ) has been used to treat patients in both Europe and North America, Big Pharma with the support of the governments is intent upon suppressing evidence on how COVID-19 can be cured, without the need of a vaccine. (See Chapter VI) The Covid Vaccine and “Herd Immunity”: Changing the Definitions\nHerd immunity is an important concept in medicine. According to Healthline:\n“It happens when so many people in a community become immune to an infectious disease that it stops the disease from spreading.\nThis can happen in two ways:\n1. Many people contract the disease and in time build up an immune response to it (natural immunity).\n2. Many people are vaccinated against the disease to achieve immunity.\nHerd immunity can work against the spread of some diseases. There are several reasons why it often works.” (See Healthline)\nThe WHO has redefined herd immunity with a view to supporting the multibillion dollar Covid vaccine initiative:\nBelow (Left) is the official WHO definition (June 2020). And in November (Right) the WHO decided unilaterally to redefine a fundamental medical concept, focussing solely on the role of vaccination in achieving herd immunity.\nTo our knowledge, the peer reviewed definition of herd immunity has not changed.\nThe new “definition” of the WHO visibly serves the interests of Big Pharma. Flashback: The 2009 H1N1 Swine Flu Pandemic\nRemember the 2009 H1N1 “pandemic” when Obama’s Council of Advisors on Science and Technology compared the H1N1 pandemic to the 1918 Spanish flu pandemic while reassuring the public that the latter was more deadly. (CBC: Get swine flu vaccine ready: U.S. advisers). For further details see Michel Chossudovsky, August 2009 Study on H1N1 Pandemic )\nBased on incomplete and scanty data, the WHO Director General Margaret Chan predicted with authority that: “ as many as 2 billion people could become infected over the next two years — nearly one-third of the world population. ” (World Health Organization as reported by the Western media, July 2009).\nIt was a multibillion bonanza for Big Pharma supported by the WHO’s Director-General Margaret Chan.\nIn a subsequent statement Dr. Chan confirmed that:\n“Vaccine makers could produce 4.9 billion pandemic flu shots per year in the best-case scenario”, Margaret Chan, Director-General, World Health Organization (WHO) , quoted by Reuters, 21 July 2009).\n“ Swine flu could strike up to 40 percent of Americans over the next two years and as many as several hundred thousand could die if a vaccine campaign and other measures aren’t successful.” (Official Statement of Obama Administration, Associated Press, 24 July 2009).\nThere was no H1N1 pandemic affecting 2 billion people. Millions of doses of swine flu vaccine had been ordered by national governments from Big Pharma.\nMillions of vaccine doses were subsequently destroyed: a financial bonanza for Big Pharma, an expenditure crisis for national governments.\nThere was no investigation into who was behind this multibillion dollar fraud. Several critics said that the H1N1 Pandemic was “Fake”\nThe Parliamentary Assembly of the Council of Europe (PACE), a human rights watchdog, is publicly investigating the WHO’s motives in declaring a pandemic. Indeed, the chairman of its influential health committee, epidemiologist Wolfgang Wodarg, has declared that the “false pandemic” is “one of the greatest medicine scandals of the century.” (Michael Fomento, Forbes , February 10, 2010)\nMichael Fomento concludes:\nEven within the agency, the director of the WHO Collaborating Center for Epidemiology in Munster, Germany, Dr. Ulrich Kiel, has essentially labeled the pandemic a hoax. “We are witnessing a gigantic misallocation of resources [$18 billion so far] in terms of public health,” he said.\nThey’re right. This wasn’t merely overcautiousness or simple misjudgment. The pandemic declaration and all the Klaxon-ringing since reflect sheer dishonesty motivated not by medical concerns but political ones.\nUnquestionably, swine flu has proved to be vastly milder than ordinary seasonal flu. It kills at a third to a tenth the rate, according to U.S. Centers for Disease Control and Prevention estimates. Data from other countries like France and Japan indicate it’s far tamer than that."}, "3": {"news": "The total solution to SARS-CoV 2 Antigen and Neutralizing Antibody Detection. February 10 17:33 2021 by admin As of February 9, 2021, there are more than 27 million confirmed new coronavirus infections worldwide, and the number of confirmed infections per day is still increasing at a rate of over 500,000. When will this war between humans and viruses end? In the face of powerful “enemies”, we are not afraid, because vaccines will become our powerful weapons. At present, many countries and regions around the world have carried out large-scale COVID-19 vaccination. The protective effect of the vaccine is to cause the body’s immune response to produce neutralizing antibodies, which are protective antibodies that can bind to the virus and prevent the virus from binding to the receptor on the host cell. The traditional method for detecting neutralizing antibodies is a live virus titration and neutralization experiment, which has high risks, time-consuming, and complicated operations, which brings great inconvenience to large-scale population vaccination evaluation. Therefore, it is very meaningful to establish a method for rapid detection of neutralizing antibodies. Beijing Hotgen Biotech Co., Ltd. is a high-tech enterprise integrating R&D, production and sales. Based on advanced technology, it has developed various reagents and instruments for in vitro diagnostics. Regarding the new coronavirus, Hotgen Biotech provides a complete set of solutions from pathogen detection (nasopharyngeal swabs or saliva samples) to antibody detection and neutralizing antibody detection to meet the needs of epidemic prevention and control in various scenarios. New coronavirus neutralizing antibody detection kit (colloidal gold method), can detect the SARS-CoV-2 neutralizing antibody rapidly. The kit uses a double antigen sandwich method, and the antigen is a highly specific receptor binding domain of the new coronavirus S protein(S-RBD), which can be used to detect total neutralizing antibodies produced by the human body, including IgA, IgM and IgG. No equipment is needed, and accurate test results can be obtained in 15 minutes. In addition, Hotgen Biotech also provides a neutralizing antibody detection kit based on the competition method, which uses magnetic particle chemiluminescence technology for a accurate results. The following products have obtained the EU CE certification, as will as launched on the white listed in Germany, Britain, Spain Italy, Austria, Thailand and other countries and regions, which are well received by customers. Novel Coronavirus antigen detection product 2. Novel Coronavirus neutralizing antibody detection product For more product information, please contact Mr. Gene Wang: +86-13811922559"}, "4": {"news": "Institutional & Family Asset Management LLC Grows Position in NetEase, Inc. (NASDAQ:NTES). Institutional & Family Asset Management LLC Grows Position in NetEase, Inc. (NASDAQ:NTES) Posted by Chris Copeland on Feb 10th, 2021 Tweet\nInstitutional & Family Asset Management LLC lifted its stake in NetEase, Inc. (NASDAQ:NTES) by 400.0% in the 4th quarter, according to the company in its most recent filing with the Securities and Exchange Commission. The institutional investor owned 14,190 shares of the technology company’s stock after acquiring an additional 11,352 shares during the period. Institutional & Family Asset Management LLC’s holdings in NetEase were worth $1,359,000 at the end of the most recent quarter.\nOther hedge funds have also recently added to or reduced their stakes in the company. Genesis Investment Management LLP increased its holdings in shares of NetEase by 376.2% during the third quarter. Genesis Investment Management LLP now owns 2,751,873 shares of the technology company’s stock valued at $239,248,000 after acquiring an additional 2,174,000 shares in the last quarter. Fisher Asset Management LLC raised its position in shares of NetEase by 398.3% in the fourth quarter. Fisher Asset Management LLC now owns 2,048,267 shares of the technology company’s stock worth $196,163,000 after acquiring an additional 1,637,203 shares during the period. California Public Employees Retirement System grew its holdings in NetEase by 540.5% in the fourth quarter. California Public Employees Retirement System now owns 1,172,833 shares of the technology company’s stock valued at $112,322,000 after purchasing an additional 989,727 shares during the period. Overlook Holdings Ltd acquired a new stake in NetEase in the 3rd quarter valued at $391,925,000. Finally, Harvest Fund Management Co. Ltd raised its position in shares of NetEase by 310.8% during the 3rd quarter. Harvest Fund Management Co. Ltd now owns 913,050 shares of the technology company’s stock worth $82,740,000 after purchasing an additional 690,811 shares during the last quarter. Get NetEase alerts:\nA number of equities analysts have weighed in on NTES shares. The Goldman Sachs Group boosted their price objective on NetEase from $104.00 to $107.00 and gave the stock a “buy” rating in a research note on Monday, November 2nd. Industrial Alliance Securities started coverage on shares of NetEase in a report on Thursday, December 31st. They issued an “outperform” rating for the company. Finally, Zacks Investment Research raised shares of NetEase from a “sell” rating to a “hold” rating in a research report on Wednesday, January 6th. Two investment analysts have rated the stock with a hold rating and eleven have given a buy rating to the company. NetEase presently has an average rating of “Buy” and an average target price of $98.78. Shares of NTES stock traded down $2.51 during trading hours on Wednesday, hitting $129.91. The stock had a trading volume of 45,413 shares, compared to its average volume of 2,634,324. The firm has a market capitalization of $83.12 billion, a PE ratio of 43.33, a PEG ratio of 11.96 and a beta of 0.61. The stock’s 50 day moving average is $108.69 and its 200 day moving average is $96.03. NetEase, Inc. has a twelve month low of $53.17 and a twelve month high of $133.75.\nNetEase (NASDAQ:NTES) last issued its quarterly earnings results on Wednesday, November 18th. The technology company reported $5.35 earnings per share for the quarter, topping the Zacks’ consensus estimate of $0.26 by $5.09. NetEase had a net margin of 20.47% and a return on equity of 19.03%. The firm had revenue of $2.75 billion during the quarter, compared to analysts’ expectations of $2.64 billion. On average, research analysts expect that NetEase, Inc. will post 2.87 EPS for the current year.\nNetEase Profile\nNetEase, Inc is an internet technology company, which premium online services centered around content, community, communication and commerce. It develops and operates some of the most popular PC-client and mobile games in China. The firm also operates some of the most popular international online games in China by partnering with Blizzard Entertainment, Mojang AB (a Microsoft subsidiary) and other global game developers.\nRead More: Trading Strategy\nWant to see what other hedge funds are holding NTES? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for NetEase, Inc. (NASDAQ:NTES). Receive News & Ratings for NetEase Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for NetEase and related companies with MarketBeat.com's FREE daily email newsletter ."}, "5": {"news": "Kite surfer leaves Sydney with world distance record in reach. By Liam Phelan February 11, 2021 — 2.33pm A book he was given 15 years ago inspired former brewer Brian Kiss von Soly to attempt the longest kite surfing journey in the world – and he is set to reach the world record after he surfs off from southern Sydney on Thursday afternoon.\nBrian Kiss von Soly is kite surfing from northern NSW to Melbourne, attempting to smash the world distance record along the way. Credit: Jonathan Carroll\nMr Kiss von Soly, from Ocean Shores on the NSW North Coast, is attempting to kite surf from northern NSW to his home town of Melbourne. He set off on December 28, 2020 and has so far travelled about 800 kilometres, with the record of 862 kilometres in his reach if he makes it from Bundeena to Wollongong this afternoon.\nThe 36-year-old has been kite surfing for 15 years but it was a gift of the Guinness Book of World Records he got when he was 21 years old that planted the seed for this journey.\n“I looked through the book and thought what records could I do. I tried onion eating but that was way too hard,” the former brewer for Balter beer joked.\nAdvertisement\nBrian Kiss von Soly set off from northern NSW.\nAt the end of last year he decided to attempt the kite surfing record instead. Mr Kiss von Soly travels with a waterproof 60-litre backpack and can cover up to 60 nautical miles a day if the conditions are favourable. When the wind turns against him he carries a hammock or stays with people he meets along the way.\n“Normally I would have had a lot better winds but this year there has been a lot of southerlies. That is slowing me up,” he said.\nThe kite surfer gets as far as 15 kilometres offshore. He carries about three litres of water in a pouch and aims to come ashore every evening.\n“I can only do this thanks to the technology,” Mr Kiss von Soly says. “I travel with a GPS and an EPIRB that links to my watch. It’s good because I am pretty directionally challenged. I wouldn’t have a clue where I was if it wasn’t for the maps.”\nMr Kiss von Soly, who is a vegan, is followed by birds and has had dolphins swim around his board. He’s even seen a shark just before he landed at Bundeena, south of Sydney, where he spent a week waiting for a decent northerly blow, having travelled from Palm Beach straight past the Heads.\nKiss von Soly’s campsite.\n“I had good winds that day so kept pushing south. If the winds pick up this afternoon I will aim for Coalcliff or Bulli,” Mr Kiss von Soly said on Thursday lunchtime.\n“It can get pretty gnarly out there but I do everything I can to reduce the risks and stay safe. My mum still worries about me, though.”\nYou can follow the journey here .\nCatch all the day’s headlines At the end of each day, we’ll send you the most important breaking news headlines, evening entertainment ideas and a long read to enjoy. Sign up to The Sydney Morning Herald ’s newsletter here , The Age ’s here , Brisbane Times ’ here , and WAtoday ’s here ."}, "6": {"news": "Meyer Handelman Co. Purchases 3,060 Shares of TE Connectivity Ltd. (NYSE:TEL). Meyer Handelman Co. Purchases 3,060 Shares of TE Connectivity Ltd. (NYSE:TEL) Tweet\nMeyer Handelman Co. increased its position in shares of TE Connectivity Ltd. (NYSE:TEL) by 2.4% in the 4th quarter, according to the company in its most recent 13F filing with the Securities & Exchange Commission. The institutional investor owned 132,718 shares of the electronics maker’s stock after acquiring an additional 3,060 shares during the quarter. Meyer Handelman Co.’s holdings in TE Connectivity were worth $16,067,000 as of its most recent SEC filing.\nA number of other large investors have also recently bought and sold shares of TEL. Perigon Wealth Management LLC acquired a new stake in TE Connectivity in the fourth quarter valued at approximately $31,000. Prospera Financial Services Inc purchased a new stake in shares of TE Connectivity during the 3rd quarter valued at $33,000. JJJ Advisors Inc. boosted its position in shares of TE Connectivity by 527.3% in the 4th quarter. JJJ Advisors Inc. now owns 276 shares of the electronics maker’s stock worth $33,000 after purchasing an additional 232 shares in the last quarter. CX Institutional grew its stake in TE Connectivity by 59.5% during the 3rd quarter. CX Institutional now owns 362 shares of the electronics maker’s stock worth $35,000 after buying an additional 135 shares during the last quarter. Finally, NEXT Financial Group Inc acquired a new position in TE Connectivity during the 3rd quarter valued at about $43,000. 91.35% of the stock is owned by institutional investors. Get TE Connectivity alerts:\nTEL has been the subject of several recent analyst reports. Robert W. Baird reissued an “outperform” rating and issued a $118.00 price target on shares of TE Connectivity in a report on Monday, October 19th. Jefferies Financial Group lifted their target price on shares of TE Connectivity from $107.00 to $126.00 and gave the stock a “buy” rating in a research note on Thursday, October 15th. UBS Group upped their price target on shares of TE Connectivity from $135.00 to $150.00 and gave the company a “buy” rating in a research note on Thursday, January 28th. TheStreet raised shares of TE Connectivity from a “c” rating to a “b” rating in a report on Wednesday, October 28th. Finally, Cowen boosted their price objective on shares of TE Connectivity from $125.00 to $140.00 and gave the company an “outperform” rating in a report on Tuesday, February 2nd. Four investment analysts have rated the stock with a hold rating and ten have assigned a buy rating to the company’s stock. The stock has an average rating of “Buy” and a consensus target price of $111.79. In related news, Director Terrence R. Curtin sold 70,250 shares of the stock in a transaction on Thursday, February 4th. The shares were sold at an average price of $127.75, for a total transaction of $8,974,437.50. Following the sale, the director now directly owns 125,219 shares of the company’s stock, valued at $15,996,727.25. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through this link . Also, SVP Robert J. Ott sold 23,900 shares of the stock in a transaction on Wednesday, November 18th. The stock was sold at an average price of $111.86, for a total transaction of $2,673,454.00. Insiders sold 173,688 shares of company stock worth $21,029,106 in the last 90 days. Company insiders own 0.80% of the company’s stock.\nShares of TEL stock traded down $0.69 during trading hours on Wednesday, hitting $128.10. The company’s stock had a trading volume of 39,890 shares, compared to its average volume of 2,040,664. The stock has a market cap of $42.39 billion, a PE ratio of -178.87, a price-to-earnings-growth ratio of 2.35 and a beta of 1.41. TE Connectivity Ltd. has a 12-month low of $48.62 and a 12-month high of $131.97. The company has a 50 day moving average of $125.15 and a 200 day moving average of $108.41. The company has a current ratio of 1.57, a quick ratio of 1.04 and a debt-to-equity ratio of 0.37.\nTE Connectivity (NYSE:TEL) last posted its earnings results on Tuesday, January 26th. The electronics maker reported $1.47 earnings per share (EPS) for the quarter, beating analysts’ consensus estimates of $1.29 by $0.18. The company had revenue of $3.52 billion during the quarter, compared to the consensus estimate of $3.26 billion. TE Connectivity had a negative net margin of 1.98% and a positive return on equity of 14.86%. The firm’s quarterly revenue was up 11.2% on a year-over-year basis. During the same period in the previous year, the firm posted $1.21 earnings per share. As a group, analysts anticipate that TE Connectivity Ltd. will post 5.3 earnings per share for the current fiscal year.\nThe business also recently disclosed a quarterly dividend, which will be paid on Friday, March 5th. Stockholders of record on Friday, February 19th will be issued a $0.48 dividend. The ex-dividend date is Thursday, February 18th. This represents a $1.92 annualized dividend and a dividend yield of 1.50%. TE Connectivity’s dividend payout ratio (DPR) is presently 45.07%.\nAbout TE Connectivity\nTE Connectivity Ltd., together with its subsidiaries, manufactures and sells connectivity and sensor solutions in Europe, the Middle East, Africa, the AsiaÂ-Pacific, and the Americas. The company operates through three segments: Transportation Solutions, Industrial Solutions, and Communications Solutions.\nFeatured Story: What is the LIBOR?\nWant to see what other hedge funds are holding TEL? Visit HoldingsChannel.com to get the latest 13F filings and insider trades for TE Connectivity Ltd. (NYSE:TEL). Receive News & Ratings for TE Connectivity Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for TE Connectivity and related companies with MarketBeat.com's FREE daily email newsletter ."}, "7": {"news": "Here’s why despite a new ATH, Ethereum isn’t out of the woods. Bitcoin Ethereum News\nAfter recording yet another ATH on the charts, one well beyond $1,800, Ethereum currently has its eyes set on the $2,000-mark. While quite a few of its on-chain metrics are flashing positive signs, other noticeable concerns are creeping up as well. The culprit here, according to many, is a familiar foe (fee*). Source: Coinstats Ethereum registers high active addresses, large addresses\nTicking off some of its optimistic signs, according to CoinMetrics’ latest report, Ethereum has been noting an increase in active addresses since the summer of June 2020, with the active addresses averaging between 500k-600k since January 2021. Source: CoinMetrics\nAdditionally, it was also identified that addresses holding significant amounts of ETH have registered constructive growth, with the number of addresses holding at least 10k ETH improving too. Now, with the introduction of CME ETH Futures, the mood around Ether is even more hopeful, however, its massive transaction fees deserve a lot of scrutiny too. How long can ETH maintain demand with such high fees?\nThat is the biggest issue for Ethereum right now. The high transaction fees are only due to the increasing demand for block space on its network. However, the fees are getting a little out of hand and climbing to new all-time highs too, even when compared to the highs registered during the DeFi season of August-September 2020.\nAccording to the aforementioned report,\n“The average ETH transaction fee reached $25.80, its highest level ever. The median transaction fee topped $14.32.” Source: Glassnode\nFor context, Ethereum miners earned $3.74 million in a single hour last Friday, amassing over $55 million on the same day; another ATH. Small investors fear: Are other networks catching up?\nA major concern associated with large fees is that the median value of the transaction is currently going up and it may lead to smaller investors getting priced out of the network. The same goes for developers as if DeFi devs identify a better scalable network, they may jump ship if Ethereum is not able to solve its fee-situation.\nAccording to Ryan Selkis of Messari, EIP-1559 makes a compelling argument, but,\n“It also ignores the reality that Ethereum’s scaling plans explicitly call for pushing transactions off of the expensive, gas-guzzling main chain and onto roll-up chains (or competitive layer 1s).”\nNow, other competitive layers might be catching up already. Source: Trading View\nSome of the other primarily scalable layer 1 networks have completely outperformed Ethereum in 2021, networks including Cardano and other rising projects such as Polkadot and Avalanche. Here, it is important to note that the volume of activity witnessed by Ethereum is levels above these other projects, but their growing valuation suggests they have improving traction as well.\nEthereum might be on the clock to limit its transaction fees over the next few months, otherwise, these projects will only go on to gain even more traction. Sign Up For Our Newsletter\nSource: https://ambcrypto.com/heres-why-despite-a-new-ath-ethereum-isnt-out-of-the-woods/"}, "8": {"news": "Proud Boy charged in Capitol riot slams Trump's 'deception'. Brad Reed February 10, 2021\nA man accused by federal prosecutors of taking part in the January 6th Capitol riots filled up his Facebook page with photographs of birds that he had killed and that he then named after Democratic lawmakers.\nPennLive.com reports that Lancaster County resident Michael Lopatic Sr. was charged this week with repeatedly punching a Capitol police officer and then stealing another officer's body camera during the MAGA riots at the United States Capitol building. <p>\"Prosecutors say Lopatic continuously punched the officer in the head, then grabbed him by the head and hit him with an uppercut punch,\" PennLive.com reports. \"That's when Lopatic went back to the other officer, who was now surrounded by people trying to form a human shield and protect him from the violent members of the mob. Lopatic reached into the crowd and stole that officer's body camera, which would have contained crucial evidence in the investigation, prosecutors say.\"</p><p>Prosecutors claim that Lopatic had been deploying violent rhetoric on his Facebook page for weeks leading up to the Capitol riots.</p><p>Among other things, he posted photos of birds that he killed while hunting and informed his followers that he had named the dead birds after prominent Democrats, including President Joe Biden, Vice President Kamala Harris, Senate Majority Leader Chuck Schumer, and House Speaker Nancy Pelosi.</p><p><a href=\"https://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/e/28/e2882e94-6b33-11eb-bd5b-cb386a92d619/602323bfd7df1.pdf.pdf\" target=\"_blank\">Read the entire indictment here (PDF)</a>.</p> Amanda Marcotte, Salon February 10, 2021\nTuesday was the first day of Donald Trump's impeachment trial for inciting an insurrection, and, frustratingly, the day was devoted to the question of whether it was legal to even try Trump, now a former president, in the first place. The whole thing was a dog-and-pony show for Senate Republicans, who don't want to be caught looking supportive of an insurrection that failed. But they also don't want to offend their voters, who are still largely enthused about fascist insurrections and want to give Trump an A for effort. And so Republicans have settled on pretending they're springing Trump on a technicality — even though no one really believes such a technicality exists — in a pathetic bid to have it both ways. It felt like a waste of time because no one actually believes this trial is unconstitutional.\nBut there's one silver lining: The Democrats who are arguing the case as the House managers so thoroughly smoked Trump's defense that even Trump knows it. <p>Rep. Jamie Raskin of Maryland introduced a devastating video underscoring how Trump very deliberately sent an angry mob to storm the Capitol on Jan. 6 — telling them, \"<a href=\"https://digbysblog.net/2021/02/very-different-rules/\" rel=\"noopener noreferrer\" target=\"_blank\">you're allowed to go by very different rules</a>\" than the usual expectations of non-violence — and highlighting the horrors of the insurrection, which left five people dead and multiple police officers seriously injured. </p><p>Raskin ended the House managers' arguments with a terrifying description of his own experiences that day, <a href=\"https://www.washingtonpost.com/opinions/2021/02/10/jamie-raskin-won-trial-before-it-began/\" rel=\"noopener noreferrer\" target=\"_blank\">breaking into tears as he recounted the terror of his family members</a> who were visiting him following the funeral of his young son the day before. </p><p>In contrast, <a href=\"https://www.salon.com/2021/02/09/trump-impeachment-lawyers-terrible-opening-argument-stuns-observers_partner/\" rel=\"noopener noreferrer\" target=\"_blank\">Trump's lawyers presented arguments that were equal parts smug and incoherent</a>. His first lawyer, Bruce Castor, condescendingly suggested that because people are understandably emotional about the insurrection their arguments are rendered irrational. It's an especially offensive argument to be made in defense of Trump, a man who is all id and no rationality. Castor's patronizing tone was made all the more annoying by the fact that his arguments were erratic and inconsistent nonsense. That's especially so compared to the devastating case made earlier in the afternoon <a href=\"https://www.nbcnews.com/video/rep-neguse-defends-impeachment-trial-of-former-president-trump-as-constitutional-100758597703\" rel=\"noopener noreferrer\" target=\"_blank\">by Rep. Joe Neguse of Colorado, who painstakingly laid out why</a> the trial was constitutional and that no one doubted it before they needed a convenient excuse to let Trump off the hook.</p><p>But hey, don't take my word for it that the House managers left Trump's defense team a smoking crater. Trump himself reportedly believes it. </p><p>\"Mr. Trump, who often leaves the television on in the background even when he is holding meetings, was furious, people familiar with his reaction said,\"<a href=\"https://www.nytimes.com/2021/02/09/us/politics/trump-bruce-castor-david-schoen.html?action=click&module=Spotlight&pgtype=Homepage\" target=\"_blank\">Maggie Haberman of the New York Times reported</a>. \"On a scale of one to 10, with 10 being the angriest, Mr. Trump 'was an eight,' one person familiar with his reaction said.\"<br/></p><p>CNN's <a href=\"https://www.rawstory.com/trump-screaming-during-impeachment/\" target=\"_self\">Kaitlin Collins corroborated the account</a>. \"I'm being told by two people familiar with former President Trump's reaction, he was deeply unhappy with that performance and borderline screaming,\" Collins reported. </p><p>\"The former president — monitoring the trial on television from Florida — had expected a swashbuckling lawyer and instead watched what was a confusing and disjointed performance,\"<a href=\"https://www.washingtonpost.com/politics/trump-impeachment-trial-florida/2021/02/09/03ccaa72-6a61-11eb-9f80-3d7646ce1bc0_story.html\" target=\"_blank\">Ashley Parker and Josh Daswey at the Washington Post wrote</a>. </p><p>\"As [Trump's lawyers] droned on, he grew increasingly frustrated with the sharp contrast between their muted response and the prosecution's opening salvo,\"<a href=\"https://www.politico.com/news/2021/02/09/trump-impeachment-team-468112\" rel=\"noopener noreferrer\" target=\"_blank\">Gabby Orr and Meredith McGraw at Politico reported.</a></p><p><a href=\"https://www.politico.com/news/2021/02/09/trump-impeachment-team-468112\" rel=\"noopener noreferrer\" target=\"_blank\"></a>To be fair to Castor and David Schoen, Trump's other lawyer who argued on Tuesday, their task is impossible. There's no way to mount a convincing defense of Trump, <a href=\"https://www.justsecurity.org/74138/incitement-timeline-year-of-trumps-actions-leading-to-the-attack-on-the-capitol/\" target=\"_blank\">who spent months publicly inciting his followers to violence</a> in <a href=\"https://www.salon.com/2020/11/02/trump-is-encouraging-anti-democratic-violence--but-dont-let-that-stop-you/\" target=\"_blank\">incredibly unsubtle ways</a>. But Trump, ever the believer in the magic of bullshit, clearly believes there's some way to spin this so he looks like the good guy. And why not? \"The Apprentice\" used TV stratagems to trick Americans into believing Trump was a successful businessman. He successfully bamboozled 74 million Americans into thinking he was qualified to be president. Why shouldn't he imagine that a little razzle-dazzle would work this time around?</p><p>In any world where Senate Republicans gave a crap about justice, rationality, good argumentation, or even reality, <a href=\"https://www.salon.com/2021/02/10/trumps-lawyers-make-a-mockery-of-republican-senators-impeachment-trial-makes-gop-complicity-clear/\" target=\"_blank\">Trump's conviction would be a done deal</a>. Sadly, however, Republicans care for none of those values. Only one Republican, Sen. Bill Cassidy of Louisiana, was so embarrassed by how bad Trump's legal arguments were that <a href=\"https://www.cnn.com/2021/02/09/politics/six-republicans-vote-impeachment-trial/index.html\" target=\"_blank\">he switched from opposing the trial to supporting it</a>, joining only five other Republican senators who are acceding to reality on this one. The <a href=\"https://www.washingtonpost.com/lifestyle/media/impeachment-insurrection-video/2021/02/09/85463eb0-6b1f-11eb-ba56-d7e2c8defa31_story.html\" target=\"_blank\">other 44 Republicans spent the trial looking away</a>, doodling, faking interest in paperwork, or otherwise distracting themselves from their own choice to self-humiliate by pretending to believe a word of Trump's stupid defense arguments.<br/></p><p>Still, the former president's fury tells us something.</p><p>Trump is a profoundly stupid man, but he has an animalistic instinct for what makes for watchable TV. He clearly understands that the House managers trying the case are making him look bad. That is all the more reason why Democrats shouldn't want to hurry this trial along, <a href=\"https://www.salon.com/2021/02/09/democrats-drop-the-ball-on-trumps-second-impeachment-before-the-trial-even-begins/\" target=\"_blank\">but draw out the pain by calling witnesses</a>. Republicans are too cowardly to convict Trump. Democrats only have one chance of humiliating him so badly that he withdraws from politics for good. It very well might be a faint chance, but it's a better bet than expecting the majority of Republican senators to grow a spine and vote to convict. </p> Bob Brigham February 10, 2021\nRep. Joe Neguse (D-CO) is the youngest House impeachment manager and broke down the case against former President Donald Trump during the second day of the Senate impeachment trial.\nNeguse argued that there were three aspects to Trump's provocation, citing his \"big lie\" that the election was stolen, his \"stop the steal\" talking point and his command to \"fight like hell.\" <p>He went on to argue that the provocation resulted in the attack on the capitol on January 6th.</p><p>\"That mob was summoned, assembled and incited by the former President of the United States, Donald Trump,\" he argued.</p><p>After dissecting Trump's speech before the insurrection, Neguse noted that Trump did not seek to stop the riot.</p><p>\"He had the power to stop it,\" he argued. \"And he didn't.\"</p><p>\"\"He didn't just tell them to fight like hell. He told them how, when and where,\" he said.</p><p><br/></p><div class=\"rm-shortcode\" data-rm-shortcode-id=\"78cf6437a8221cb22d0006a778f1c430\" id=\"f6220\"><blockquote class=\"twitter-tweet twitter-custom-tweet\" data-partner=\"rebelmouse\" data-twitter-tweet-id=\"1359556321532653571\"><div style=\"margin:1em 0\">Rep. Joe Neguse on Capitol rioters: \"They did it all in plain sight—proudly, openly and loudly. Because they believ… https://t.co/Xz9Ez3Lj5a</div> — ABC News (@ABC News)<a href=\"https://twitter.com/ABC/statuses/1359556321532653571\">1612978461.0</a></blockquote></div><p><br/></p><div class=\"rm-shortcode\" data-rm-shortcode-id=\"f4bc43aa305579d0836bed5ceacaf9ea\" id=\"9a2ad\"><blockquote class=\"twitter-tweet twitter-custom-tweet\" data-partner=\"rebelmouse\" data-twitter-tweet-id=\"1359559177912393738\"><div style=\"margin:1em 0\">House impeachment manager Joe Neguse on threats against election officials: When Donald Trump \"saw firsthand the vi… https://t.co/QXxwbS4acq</div> — ABC News (@ABC News)<a href=\"https://twitter.com/ABC/statuses/1359559177912393738\">1612979142.0</a></blockquote></div><p><br/></p><div class=\"rm-shortcode\" data-rm-shortcode-id=\"718354dfbbc48ae6eb7250ba4ca1f5a2\" id=\"b21f7\"><blockquote class=\"twitter-tweet twitter-custom-tweet\" data-partner=\"rebelmouse\" data-twitter-tweet-id=\"1359561468254040071\"><div style=\"margin:1em 0\">House impeachment manager Rep. Joe Neguse asks what would have happened if then-Pres. Trump had said \"stop the atta… https://t.co/KoZX6iNTSq</div> — ABC News (@ABC News)<a href=\"https://twitter.com/ABC/statuses/1359561468254040071\">1612979688.0</a></blockquote></div>"}, "9": {"news": "WAIT WHAT? Man Charged in Capitol Riot a Former FBI Agent, Holds Top Secret Security Clearance. WAIT WHAT? Man Charged in Capitol Riot a Former FBI Agent, Holds Top Secret Security Clearance 02/10/2021 By Leave a Comment\n( Jamie White ) Add feds to list of agitators in Capitol riot along with Antifa and BLM.\nby Jamie White , February, 9th, 2021\nA Navy veteran charged in the Capitol riot has worked for the FBI and has held a top security clearance for over 40 years, his lawyer claimed.\nThe lawyer of Thomas Edward Caldwell, 66, made the claims in a court filing Tuesday arguing for Caldwell’s release from detention pending trial.\n“He has held a Top Secret Security Clearance since 1979 and has undergone multiple Special Background Investigations in support of his clearances,” Caldwell’s attorney Thomas Plofchan wrote.\n“After retiring from the Navy, he worked as a section chief for the Federal Bureau of Investigation from 2009-2010 as a GS-12 [mid-level employee].”\nPlofchan added that Caldwell performed consulting work at the classified level for numerous government agencies and the military after leaving the Navy.\n“He also formed and operated a consulting firm performing work, often classified, for U.S. government customers including the U.S. Drug Enforcement Agency, the Department of Housing and Urban Development, the U.S. Coast Guard, and the U.S. Army Personnel Command.”\nThe FBI hasn’t commented on the revelation since it was first reported by The Hill .\nThe shocking revelation of a former FBI employee taking a lead in the Capitol riot wasn’t lost on social media.\nThis comes after numerous reports emerged revealing Antifa and Black Lives Matter also took a lead in the Capitol riot on January 6.\nRead the court filing:\n Editor : Why did we post this?\nThe news is important to all people because it is where we come to know new things about the world, which leads to the development of more life goals that lead to life wisdom. The news also serves as a social connection tool, as we tend to relate to those who know about and believe the things we do. With the power of an open truth-seeking mind in hand, the individual can grow wise and the collective can prosper. – Justin Not sure how to make sense of this? Want to learn how to discern like a pro? Read this essential guide to discernment, analysis of claims, and understanding the truth in a world of deception: 4 Key Steps of Discernment – Advanced Truth-Seeking Tools . Editor’s note: Did you find a spelling error or grammatical mistake? Send an email to corrections@stillnessinthestorm.com , with the error and suggested correction, along with the headline and url . Do you think this article needs an update? Or do you just have some feedback? Send us an email at sitsshow@gmail.com . Thank you for reading.\nSource:\nhttps://nworeport.me/2021/02/09/man-charged-in-capitol-riot-a-former-fbi-agent-holds-top-secret-security-clearance/ We couldn’t do it without you. Please make a donation so we can keep giving you the news and information they don’t want you to see. Notices and Disclaimers\nWe need $2000 per month to pay our costs. Help us one time or recurring . (DONATE HERE) To sign up for RSS updates, paste this link ( https://stillnessinthestorm.com/feed/ ) into the search field of your preferred RSS Reader or Service (such as Feedly or gReader). “It is the mark of an educated mind to be able to entertain a thought without accepting it.” – Aristotle\nThis website is supported by readers like you.\nIf you find our work of value, consider making a Contribution via Paypal , Patreon , or Cryptocurrencies .\n DISCLAIMER : All articles, videos, statements, claims, views and opinions that appear anywhere on this site, whether stated as theories or absolute facts, are always presented by as unverified—and should be personally fact checked and discerned by you, the reader. Any opinions or statements herein presented are not necessarily promoted, endorsed, or agreed to by Stillness, those who work with Stillness, or those who read Stillness. Any belief or conclusion gleaned from content on this site is solely the responsibility of you the reader to substantiate, fact check, and no harm comes to you or those around you. And any actions taken by those who read material on this site is solely the responsibility of the acting party. You are encouraged to think carefully and do your own research. Nothing on this site is meant to be believed without question or personal appraisal.\nContent Disclaimer: All content on this site marked with “source – [enter website name and url]” is not owned by . All content on this site that is not originally written, created, or posted as original, is owned by the original content creators, who retain exclusive jurisdiction of all intellectual property rights. Any copyrighted material on this site was shared in good faith, under fair use or creative commons. Any request to remove copyrighted material will be honored, provided proof of ownership is rendered. Send takedown requests to feedback@stillnessinthestorm.com.\nWhat is our mission? Why do we post what we do?\nOur mission here is to curate (share) articles and information that we feel is important for the evolution of consciousness. Most of that information is written or produced by other people and organizations, which means it does not represent our views or opinions as managing staff of . Some of the content is written by one of our writers and is clearly marked accordingly. Just because we share a CNN story that speaks badly about the President doesn’t mean we’re promoting anti-POTUS views. We’re reporting on the fact it was reported, and that this event is important for us to know so we can better contend with the challenges of gaining freedom and prosperity. Similarly, just because we share a pro/anti-[insert issue or topic] content, such as a pro-second amendment piece or an anti-military video doesn’t mean we endorse what is said. Again, information is shared on this site for the purpose of evolving consciousness. In our opinion, consciousness evolves through the process of accumulating knowledge of the truth and contemplating that knowledge to distill wisdom and improve life by discovering and incorporating holistic values. Thus, sharing information from many different sources, with many different perspectives is the best way to maximize evolution. What’s more, the mastery of mind and discernment doesn’t occur in a vacuum, it is much like the immune system, it needs regular exposure to new things to stay healthy and strong. If you have any questions as to our mission or methods please reach out to us at feedback@stillnessinthestorm.com. Reader Interactions"}}
